; domain
; Source: https://github.com/AI-Planning/pddl-generators/tree/main/miconic
; Fix: prevent the elevator from boarding served passengers => (not (origin ?p ?f)) effect added to board action
(define (domain miconic)
  (:requirements :strips :typing)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (and (boarded ?p) (not (origin ?p ?f))))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
;; passengers=6, floors=13, out_folder=training/easy, instance_id=61, seed=88

(define (problem miconic-61)
 (:domain miconic)
 (:objects 
    p1 p2 p3 p4 p5 p6 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 f11 f12 f13 - floor
    )
 (:init 
    (lift-at f7)
    (origin p1 f4)
    (destin p1 f7)
    (origin p2 f3)
    (destin p2 f12)
    (origin p3 f1)
    (destin p3 f10)
    (origin p4 f13)
    (destin p4 f12)
    (origin p5 f1)
    (destin p5 f7)
    (origin p6 f11)
    (destin p6 f8)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f1 f10)
    (above f1 f11)
    (above f1 f12)
    (above f1 f13)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f2 f10)
    (above f2 f11)
    (above f2 f12)
    (above f2 f13)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f3 f10)
    (above f3 f11)
    (above f3 f12)
    (above f3 f13)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f4 f10)
    (above f4 f11)
    (above f4 f12)
    (above f4 f13)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f5 f10)
    (above f5 f11)
    (above f5 f12)
    (above f5 f13)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f6 f10)
    (above f6 f11)
    (above f6 f12)
    (above f6 f13)
    (above f7 f8)
    (above f7 f9)
    (above f7 f10)
    (above f7 f11)
    (above f7 f12)
    (above f7 f13)
    (above f8 f9)
    (above f8 f10)
    (above f8 f11)
    (above f8 f12)
    (above f8 f13)
    (above f9 f10)
    (above f9 f11)
    (above f9 f12)
    (above f9 f13)
    (above f10 f11)
    (above f10 f12)
    (above f10 f13)
    (above f11 f12)
    (above f11 f13)
    (above f12 f13)
)
 (:goal  (and (served p1)
   (served p2)
   (served p3)
   (served p4)
   (served p5)
   (served p6))))

; plan
1. (down f7 f1)
   deleted: (lift-at f7)
   added: (lift-at f1)
   goals met: 0 of 6
2. (board f1 p5)
   deleted: (origin p5 f1)
   added: (boarded p5)
   goals met: 0 of 6
3. (board f1 p3)
   deleted: (origin p3 f1)
   added: (boarded p3)
   goals met: 0 of 6
4. (up f1 f10)
   deleted: (lift-at f1)
   added: (lift-at f10)
   goals met: 0 of 6
5. (depart f10 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 1 of 6
6. (down f10 f3)
   deleted: (lift-at f10)
   added: (lift-at f3)
   goals met: 1 of 6
7. (board f3 p2)
   deleted: (origin p2 f3)
   added: (boarded p2)
   goals met: 1 of 6
8. (up f3 f11)
   deleted: (lift-at f3)
   added: (lift-at f11)
   goals met: 1 of 6
9. (board f11 p6)
   deleted: (origin p6 f11)
   added: (boarded p6)
   goals met: 1 of 6
10. (down f11 f4)
   deleted: (lift-at f11)
   added: (lift-at f4)
   goals met: 1 of 6
11. (board f4 p1)
   deleted: (origin p1 f4)
   added: (boarded p1)
   goals met: 1 of 6
12. (up f4 f13)
   deleted: (lift-at f4)
   added: (lift-at f13)
   goals met: 1 of 6
13. (board f13 p4)
   deleted: (origin p4 f13)
   added: (boarded p4)
   goals met: 1 of 6
14. (down f13 f12)
   deleted: (lift-at f13)
   added: (lift-at f12)
   goals met: 1 of 6
15. (depart f12 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 2 of 6
16. (depart f12 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 3 of 6
17. (down f12 f7)
   deleted: (lift-at f12)
   added: (lift-at f7)
   goals met: 3 of 6
18. (depart f7 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 4 of 6
19. (depart f7 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 5 of 6
20. (up f7 f8)
   deleted: (lift-at f7)
   added: (lift-at f8)
   goals met: 5 of 6
21. (depart f8 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 6 of 6
